20250902T235136--kdoc-454-シェルでバイナリが文字列表示されるのはなぜか__permanent.org
:properties:
:ID: 20250902T235136
:mtime:    20250904002843
:ctime:    20250902235151
:end:
#+title:      KDOC 454: シェルでバイナリが文字列表示されるのはなぜか?
#+date:       [2025-09-02 Tue 23:51]
#+filetags:   :permanent:
#+identifier: 20250902T235136

* この文書のステータス
- 作成
  - [X] 2025-10-22 貴島
- レビュー
  - [X] 2025-10-22 貴島

* 概要

xxdでASCIIコードを渡して文字列表示できる。

#+caption: 変換する
#+begin_src shell
  echo -n "6865 6c6c 6f0a" | xxd -r -p
#+end_src

#+RESULTS:
#+begin_src
hello
#+end_src

- ~xxd~ はバイナリ <--> 16進数を変換表示するコマンド
- -r オプションで、16進数表示からバイナリ表示に切り替わる

ここで生まれる疑問は、 ~-r~ オプションによって16進数表示から「バイナリ」表示に切り替わっているはずだが、アルファベットが表示されていることだ。

仮定は、「ASCIIで解釈可能なバイナリは端末上で表示すると解釈されてアルファベット表示される」だ。

#+caption: バイナリを書き込んで表示する
#+begin_src shell
  printf '\x61' > a.bin
  cat a.bin
  rm a.bin # 片付け
#+end_src

#+RESULTS:
#+begin_src
a
#+end_src

考えてみると、プレーンテキストだろうと何でもバイナリで保存されている。端末が解釈してアルファベット表示するのは自然である。

さらに直感的に確認する方法か公式仕様を知りたい。

* 関連
なし。
