20250902T235136--kdoc-454-シェルでバイナリが文字列表示されるのはなぜか__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:06:09Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 454: シェルでバイナリが文字列表示されるのはなぜか?</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 454: シェルでバイナリが文字列表示されるのはなぜか?</h1>
<div id="outline-container-orgf29dcc6" class="outline-2">
<h2 id="orgf29dcc6"><a href="#orgf29dcc6">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgf29dcc6">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-10-22 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-10-22 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4cfb3fa" class="outline-2">
<h2 id="org4cfb3fa"><a href="#org4cfb3fa">概要</a></h2>
<div class="outline-text-2" id="text-org4cfb3fa">
<p>
xxdでASCIIコードを渡して文字列表示できる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>変換する</label><pre class="src src-shell"><span class="org-builtin">echo</span> -n <span class="org-string">"6865 6c6c 6f0a"</span> | xxd -r -p
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">hello
</pre>
</div>

<ul class="org-ul">
<li><code>xxd</code> はバイナリ &lt;&#x2013;&gt; 16進数を変換表示するコマンド</li>
<li>-r オプションで、16進数表示からバイナリ表示に切り替わる</li>
</ul>

<p>
ここで生まれる疑問は、 <code>-r</code> オプションによって16進数表示から「バイナリ」表示に切り替わっているはずだが、アルファベットが表示されていることだ。
</p>

<p>
仮定は、「ASCIIで解釈可能なバイナリは端末上で表示すると解釈されてアルファベット表示される」だ。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>バイナリを書き込んで表示する</label><pre class="src src-shell">printf <span class="org-string">'\x61'</span> &gt; a.bin
cat a.bin
rm a.bin <span class="org-comment-delimiter"># </span><span class="org-comment">&#29255;&#20184;&#12369;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">a
</pre>
</div>

<p>
考えてみると、プレーンテキストだろうと何でもバイナリで保存されている。端末が解釈してアルファベット表示するのは自然である。
</p>

<p>
さらに直感的に確認する方法か公式仕様を知りたい。
</p>
</div>
</div>
<div id="outline-container-org8a51559" class="outline-2">
<h2 id="org8a51559"><a href="#org8a51559">関連</a></h2>
<div class="outline-text-2" id="text-org8a51559">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
